
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 8 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.api_gw_s2s_secret
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.api_gw_s2s_secret must be replaced
-/+ resource "azurerm_key_vault_secret" "api_gw_s2s_secret" {
      - content_type   = "" -> null
      ~ id             = "https://civil-shared-aat.vault.azure.net/secrets/api-gateway-s2s-secret/f2d281153a9e413bbde4ed850cacb0cf" -> (known after apply)
      ~ key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" # forces replacement
        name           = "api-gateway-s2s-secret"
      - tags           = {} -> null
      ~ version        = "f2d281153a9e413bbde4ed850cacb0cf" -> (known after apply)
      ~ versionless_id = "https://civil-shared-aat.vault.azure.net/secrets/api-gateway-s2s-secret" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
      - content_type   = "" -> null
      ~ id             = "https://civil-shared-aat.vault.azure.net/secrets/civil-sdt-servicebus-connection-string/a060d0776f204ee895c36f789f7f65d8" -> (known after apply)
      ~ key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" # forces replacement
        name           = "civil-sdt-servicebus-connection-string"
      - tags           = {} -> null
      ~ value          = (sensitive value)
      ~ version        = "a060d0776f204ee895c36f789f7f65d8" -> (known after apply)
      ~ versionless_id = "https://civil-shared-aat.vault.azure.net/secrets/civil-sdt-servicebus-connection-string" -> (known after apply)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
      - content_type   = "" -> null
      ~ id             = "https://civil-shared-aat.vault.azure.net/secrets/civil-sdt-servicebus-shared-access-key/c049cb8bcfce4a9e8bd27238edd9eeed" -> (known after apply)
      ~ key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat" # forces replacement
        name           = "civil-sdt-servicebus-shared-access-key"
      - tags           = {} -> null
      ~ value          = (sensitive value)
      ~ version        = "c049cb8bcfce4a9e8bd27238edd9eeed" -> (known after apply)
      ~ versionless_id = "https://civil-shared-aat.vault.azure.net/secrets/civil-sdt-servicebus-shared-access-key" -> (known after apply)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat" -> (known after apply)
        name                                = "civil-servicebus-aat"
      ~ resource_group_name                 = "civil-shared-aat" -> "civil-service-aat" # forces replacement
        tags                                = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-sdt.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#civil-sdt"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (5 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/AuthorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat" -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      ~ capacity                            = 1 -> (known after apply)
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat" -> (known after apply)
      ~ location                            = "uksouth" -> (known after apply)
        name                                = "civil-servicebus-aat"
      ~ resource_group_name                 = "civil-shared-aat" -> "civil-service-aat"
      ~ sku                                 = "Premium" -> (known after apply)
      + tags                                = (known after apply)
      ~ zone_redundant                      = true -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "civil-sdt-in-out-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat" -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.ServiceBus/namespaces/civil-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":142,"Program":"tfcmt","SHA1":"","Vars":{}} -->